# Вложенные цикла
##  Тип 2 задание 1
Логическая функция F задаётся выражением:

((x ≡ z) → (¬y ∨ w)) ≡ ¬ ((w → z) ∨ (x → y)).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

 
```
???	???	???	???	F
1	0	 1
0	1		 1
0	0	 0	 1
```
Определите, какому столбцу таблицы истинности соответствует каждая из переменных w, x, y, z.

В ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((x==z) <= (not(y) or w)) == (not(( w <= z) or (x <= y))):
                    print(x, y, z, w)
```

##  Тип 2 задание 2
Логическая функция F задаётся выражением (¬x ∨ y ∨ z) ≡ (¬y ∧ z ∧ w). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.

 
```
?	?	?	?	F
1	1	1	1
0	0		1
1		1	1
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы. Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if (not(x) or y or z) == (not(y) and z and w):
                    print(x, y, z, w)
```
