# Тип 2.
## Задание 1.
Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
 
```
?	?	?	?	F
1	0	0	1	1
0			1	1
1	0		1
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы. Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if (((x <= y) or (y == w)) and ((x or z) == w)):
                    print(x,y,z,w)

0 0 0 0
0 0 1 1
0 1 0 0
0 1 1 1
1 1 0 1
1 1 1 1

```
Ответ: zyxw

## Задание 2.
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ w. Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

```
Переменная 1	Переменная 2	Переменная 3	Переменная 4	Функция
    ???	            ???	            ???	            ???	           F
	                                                 1             0
1				                                                   0
1	                 1			                                   0
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
print("x y z w")
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not ((x and not y) or (y == z) or w):
                    print(x,y,z,w)
x y z w
0 0 1 0
0 1 0 0
1 1 0 0
```
Ответ: yxwz


## Задание 3.
Логическая функция F задаётся выражением (¬x ≡ z) → (y ≡ (w ∨ x)).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

 
```
Переменная 1	Переменная 2	Переменная 3	Переменная 4	Функция
	???				???				???				???			   F
	 0				 0								 			   0
	 0				 				 				 0			   0
	 0								 0				 0			   0

```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not (not x == z) <= (y == (w or x)):
                    print (x,y,z,w)
0 0 1 1
0 1 1 0
1 0 0 0
1 0 0 1

```
Ответ: yxwz

## Задание 4.
Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.
```
Переменная 1	Переменная 2	Переменная 3	Функция
	???				???				???			   F
					1				 1			   0
									 1			   0
 
```

В ответе напишите буквы x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
                if not ((x == y) or ((y or z) <= x)):
                    print (x,y,z)
0 1 0
0 1 1
```
Ответ: xzy

## Задание 5.
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w.

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

```
Переменная 1	Переменная 2	Переменная 3	Переменная 4	Функция
	???				???				???				???			   F
	 0								 				 0			   0
	 0				 1				 0				 1			   0
	 				 1				 0							   0
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
```
for x in range(2):
     for y in range(2):
        for z in range(2):
             for w in range(2):
                if not ((x and not y) or (y == z) or not w):
                    print (x, y, z, w)
0 0 1 1
0 1 0 1
1 1 0 1
```
Ответ: xwzy

## Задание 6.
Логическая функция F задаётся выражением (z ∧ y) ∨ ((x → z ) ≡ (y → w)). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

```
Переменная 1	Переменная 2	Переменная 3	Переменная 4	Функция
	???				???				???				???			   F
1	0
1			1	0
1		1	1	0
```

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
for x in range(2):
     for y in range(2):
        for z in range(2):
             for w in range(2):
               if not ((z and y) or ((x <= z) == (y <= w))):
                    print (x, y, z, w)
0 1 0 0
1 0 0 0
1 0 0 1
1 1 0 1
```

# Тип 8
## Задание 1.
Все 5-⁠буквенные слова, составленные из букв В, И, Н, Т, записаны в алфавитном порядке и пронумерованы. Вот начало списка:

1.  ВВВВВ
2.  ВВВВИ
3.  ВВВВН
4.  ВВВВТ
5.  ВВВИВ
...

Запишите слово, которое стоит под номером 1019.
```
a = 'ВИНТ'
counter = 0
for i in a:
    for j in a:
        for k in a:
            for l in a:
                for m in a:
                    s = i + j + k + l + m
                    counter += 1
                    if counter == 1019:
                        print(s)
ТТТНН
```
Ответ: ТТТНН

## Задание 2.
Определите количество чисел, для записи которых в восьмеричной системе счисления требуется ровно 12 цифр, ровно 3 из которых  — нечётные, и никакие две нечётные цифры не стоят рядом.
```
from itertools import*
cnt1 = 0
cnt2 = 0
for i in product('НЧ', repeat = 12):
    p = ''.join(i)
    if p[0]=='Н' and p.count('Н')==3 and p.count('НН')==0:
        cnt1 += 1
    elif p[0]=='Ч' and p.count('Н')==3 and p.count('НН')==0:
        cnt2 += 1
print(4**12*cnt1 + 3*4**11*cnt2)

1660944384
```
Ответ: 1660944384

## Задание 3.

Вася составляет 4-⁠буквенные слова, в которых есть только буквы Б, Е, Л, К, А, причём буква Б используется в каждом слове ровно 1 раз. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?

```
from itertools import product
k = 0
for i in product('белка', repeat = 4):
    if i.count('б') == 1:
        k += 1
print(k)

256
```
Ответ: 256
